app/controllers/activities_controller.rb

  def create
    @activity = Activity.new(activity_params)
    @activity.user = @current_user
    @activity.save!
---
INSERT INTO "activities" ("title", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "erga"], ["user_id", 1], ["created_at", 2016-09-15 16:03:07 UTC], ["updated_at", 2016-09-15 16:03:07 UTC]]

  def edit
    @activity = Activity.find(params[:id])
---
SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

  def update
    @activity = Activity.find(params[:id])
    @activity.update(activity_params)
---
SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "activities" SET "title" = $1, "updated_at" = $2 WHERE "activities"."id" = $3  [["title", "Say goodbye to a sailor"], ["updated_at", 2016-09-13 02:24:31 UTC], ["id", 8]]

  def destroy
    @activity = Activity.find(params[:id])
    @activity.destroy
---
SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "activities" WHERE "activities"."id" = $1  [["id", 7]]