app/controllers/welcome_controller.rb

SELECT  "activities".* FROM "activities" ORDER BY "activities"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def index
    @activities = Activity.all